ocr/results/robustness-2026-08-13_10-31-39.txt
     ✓ [corrupt_header] create accepted or cleanly rejected
     ✓ [corrupt_header] reached terminal state (no hang)
     ✓ [truncated] create accepted or cleanly rejected
     ✓ [truncated] reached terminal state (no hang)
     ✓ [garbage_bytes] create accepted or cleanly rejected
     ✓ [garbage_bytes] reached terminal state (no hang)
     ✓ [empty_file] create accepted or cleanly rejected
     ✓ [empty_file] reached terminal state (no hang)
     ✓ [content_type_mismatch] create accepted or cleanly rejected
     ✓ [content_type_mismatch] reached terminal state (no hang)
     ✓ [oversized] create accepted or cleanly rejected
     ✓ [blank_no_text] create accepted or cleanly rejected
     ✓ [blank_no_text] reached terminal state (no hang)
     ✓ [many_pages] create accepted or cleanly rejected
     ✓ [many_pages] reached terminal state (no hang)
     ✓ [encrypted] create accepted or cleanly rejected
     ✓ [encrypted] reached terminal state (no hang)

     checks.........................: 100.00% ✓ 17       ✗ 0  
     data_received..................: 39 kB   353 B/s
     data_sent......................: 12 kB   105 B/s
     http_req_blocked...............: avg=2.17ms   min=0s      med=0s       max=92.93ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=717.81µs min=0s      med=0s       max=30.86ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=199.76ms min=41.64ms med=102.36ms max=1.29s   p(90)=409.95ms p(95)=704.73ms
       { expected_response:true }...: avg=203.53ms min=42.82ms med=106.24ms max=1.29s   p(90)=413.72ms p(95)=714.29ms
     http_req_failed................: 2.32%   ✓ 1        ✗ 42 
     http_req_receiving.............: avg=108.68µs min=0s      med=0s       max=1.55ms  p(90)=408.56µs p(95)=541.48µs
     http_req_sending...............: avg=25.78µs  min=0s      med=0s       max=1.1ms   p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=1.43ms   min=0s      med=0s       max=61.52ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=199.63ms min=41.64ms med=102.36ms max=1.29s   p(90)=409.95ms p(95)=704.27ms
     http_reqs......................: 43      0.388406/s
     iteration_duration.............: avg=12.3s    min=41.64ms med=3.19s    max=1m27s   p(90)=20.46s   p(95)=54.11s  
     iterations.....................: 9       0.081294/s
     robustness_failed..............: 5       0.045163/s
   ✓ robustness_hang................: 0.00%   ✓ 0        ✗ 8  
     robustness_success.............: 3       0.027098/s
     robustness_success_flagged.....: 3       0.027098/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1