ocr/results/smoke-2026-08-13_10-27-45.txt
     ✓ GET /health -> 200
     ✓ POST /ocr/create -> 202
     ✓ has job_id
     ✓ job reached SUCCESS
     ✗ SUCCESS job has non-empty extracted data
      ↳  0% — ✓ 0 / ✗ 1

     checks.........................: 80.00% ✓ 4       ✗ 1  
     data_received..................: 9.3 kB 1.3 kB/s
     data_sent......................: 2.5 kB 356 B/s
     http_req_blocked...............: avg=16.06ms  min=0s      med=0s      max=64.26ms  p(90)=44.98ms  p(95)=54.62ms 
     http_req_connecting............: avg=8.04ms   min=0s      med=0s      max=32.19ms  p(90)=22.53ms  p(95)=27.36ms 
     http_req_duration..............: avg=258.47ms min=10.92ms med=89.98ms max=842.97ms p(90)=617.95ms p(95)=730.46ms
       { expected_response:true }...: avg=258.47ms min=10.92ms med=89.98ms max=842.97ms p(90)=617.95ms p(95)=730.46ms
     http_req_failed................: 0.00%  ✓ 0       ✗ 4  
     http_req_receiving.............: avg=253.74µs min=0s      med=0s      max=1.01ms   p(90)=710.5µs  p(95)=862.74µs
     http_req_sending...............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=7.73ms   min=0s      med=0s      max=30.94ms  p(90)=21.66ms  p(95)=26.3ms  
     http_req_waiting...............: avg=258.21ms min=10.92ms med=89.48ms max=842.97ms p(90)=617.65ms p(95)=730.31ms
     http_reqs......................: 4      0.56304/s
     iteration_duration.............: avg=7.1s     min=7.1s    med=7.1s    max=7.1s     p(90)=7.1s     p(95)=7.1s    
     iterations.....................: 1      0.14076/s
     vus............................: 1      min=1     max=1
     vus_max........................: 1      min=1     max=1