ocr/results/smoke-2026-08-13_10-29-28.txt
     ✓ GET /health -> 200
     ✓ POST /ocr/create -> 202
     ✓ has job_id
     ✓ job reached SUCCESS
     ✓ SUCCESS job has non-empty extracted data

     checks.........................: 100.00% ✓ 5        ✗ 0  
     data_received..................: 9.7 kB  1.5 kB/s
     data_sent......................: 2.5 kB  382 B/s
     http_req_blocked...............: avg=22.44ms  min=0s      med=0s      max=89.79ms  p(90)=62.85ms  p(95)=76.32ms 
     http_req_connecting............: avg=4.96ms   min=0s      med=0s      max=19.86ms  p(90)=13.9ms   p(95)=16.88ms 
     http_req_duration..............: avg=133.7ms  min=28.81ms med=83.77ms max=338.48ms p(90)=272.39ms p(95)=305.44ms
       { expected_response:true }...: avg=133.7ms  min=28.81ms med=83.77ms max=338.48ms p(90)=272.39ms p(95)=305.44ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 4  
     http_req_receiving.............: avg=400.25µs min=0s      med=530.4µs max=540.2µs  p(90)=538.54µs p(95)=539.37µs
     http_req_sending...............: avg=133.7µs  min=0s      med=0s      max=534.8µs  p(90)=374.36µs p(95)=454.57µs
     http_req_tls_handshaking.......: avg=17.21ms  min=0s      med=0s      max=68.87ms  p(90)=48.21ms  p(95)=58.54ms 
     http_req_waiting...............: avg=133.17ms min=28.28ms med=82.96ms max=338.48ms p(90)=272.07ms p(95)=305.27ms
     http_reqs......................: 4       0.603512/s
     iteration_duration.............: avg=6.62s    min=6.62s   med=6.62s   max=6.62s    p(90)=6.62s    p(95)=6.62s   
     iterations.....................: 1       0.150878/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1